(******************************************************************************
  Copyright (c) 2014 Pasberth
  https://github.com/fairytale/fairytale.github.io
 *****************************************************************************)

open Fairytale

let hardproblem =
  Html5.M.
  (a ~a:[a_href "http://minamichihaya.github.io/hardproblem/"]
     [pcdata "ふたりのハードプロブレム"])

let contents = [
  h2 "ハドプレSS";
  Html5.M.
  (p [ hardproblem
     ; pcdata "という小説の二次創作SSです。"]);
  h3 "ハドプレSS 1";
  p "ある日希海が大学から帰ってくる(けっきょく希海はなんだかんだ言って復学したのだ)と、リコが希海に抱きついてきた！";
  s "おかえりなさい、希海さぁん……♥";
  p "なんだか妙に甘い声だ。";
  p "希海は不吉なものを感じて彼女の肩を掴んで彼女を離した。";
  s "どっ、どうしたの？　なんだか変よ？";
  p "よく見るとリコの目はとろとろで頬は紅潮している。";
  p "リコは言った。";
  s "ご飯にします？　お風呂にします？";
  p "と、希海はこれを見てなにかおかしいぞと思い、慌てて遮った。";
  s "なになになになに、今日はだれの誕生日？";
  s "ちがいますよぉ、素直な気持ちなんです";
  p "これでも希海は特定精神医療従事者の免許持っている。二種だけど。そんな希海がまず最初に考えたのはリコのFIANCが未知のニューロワームに感染してしまったということだ。";
  p "でも単純にほんとうにリコのサプライズかもしれない。";
  p "希海はたずねた。";
  s "もしこれがわたしを良い気持ちにさせるための冗談なら正直に答えて？　リコは計画的にそう言っているの？";
  p "リコは頬を膨らませて抗議した。";
  s "計画？　そんなものありませんよ。ただずっと想いを打ち明けたかっただけのことです";
  p "まちがいない。病気だ。";
  p "いや、もちろん本当にただ単にリコがそういう気持ちを持っているのかもしれないけど？";
  p "それにしては唐突すぎる。";
  s "次の休みの日、って言ってもわたし毎日朝9時に大学行かなくちゃいけないからいつになるかわかんないけど、病院に行ってしっかり検査してもらいましょう";
  p "しかしリコはアンドロイドなので病院に行くわけにも行かずけっきょくSDRの施設を借りて検査したのだった。パターン青。まちがいない。ニューロワームだ。";
  p "ニューロワームで新妻状態になるなんて話は聞いたことないのだけど、まあそういうこともあるのだろう、ともかく病気な以上、治療しなければならない。";
  p "設備を整えルーミング開始！";
  t "ルーミング成功ね。完璧っ！";
  p "と、そううまくいくわけにも行かない。";
  p "なんとその空間は地球ではなかった。";
  p "なぜ地球ではないと断言できるのか？";
  p "真っ黒な空に青い星が浮かんでいたのだ！";
  p "そしてあたりは銀色の砂漠。";
  s "ここって……月じゃない";
  p "酸欠にはならないものの重力の低さでふわふわ浮く希海。そして振り向いて10mほどの距離にリコが浮いていた。";
  s "リコ！　よかった……";
  s "希海さぁん……♥　会いたかった……♥";
  p "しかし、なぜ精神世界が月なのか？　その理由はリコの口から明かされた！";
  s "わたし、ずっと2人きりになりたかったんですよ……希海さんと……たった2人きりで……ずっと";
  p "まさか！　なんと！　月の世界は2人きりになりたいという欲望のあらわれだったのだ！";
  p "しかし！　いま、希海がそんなことを気にしている場合ではない！　問題は核！　カーネルを破壊すればリコは元通りになるはずだ！";
  p "しかし、カーネルが見当たらない？　いったいどこに？";
  p "リコが明かす。";
  s "核はあそこです";
  p "そして彼女が指差したのは……";
  p "希海は絶望する。";
  s "まさか……太陽……っ！？";
  p "まさか！　なんと！　この世界のカーネルは太陽なのだ！";
  p "希海は叫ぶ。";
  s "そんな！　太陽なんていったいどうやって破壊すれば……！　わたしの力では不可能だ！　超新星爆発級のエネルギーがないと……！";
  p "精神空間から中途離脱する方法は簡単だ。目を閉じ、自らの身体に意識を集中させればよい。";
  p "太陽を破壊するなんてそんなこと、いくら精神世界だからってぜったい不可能だ！　ひとまず逃げる---それもひとつの手段だ。";
  p "希海は絶望感から逃避を考え始めていた。";
  p "だけど！　ここで逃げるわけにはいかない！";
  p "リコを元通りにしなくちゃいけない！　これは希海に課された試練！　それは希海に託された使命なのだ！";
  p "希海は逃げなかった！　踏みとどまって戦うことを選択したのだ！";
  p "希海はリコを対話で説得しようと試みた。";
  p "核を破壊するのではなく、リコの帰りたいという気持ちを呼び覚ますことで解決しようと考えたのだ。";
  s "リコ、あなたはいま病気なのよ。自分では気づいていないかもしれないけど。気持ちは偽りのものなの";
  p "リコは答えた。";
  s "知ってます。気づいています";
  s "なら、どうして……";
  s "\"このままでもいい\"、むしろ、\"このままのほうがいい\"と思っているからです。わたしは希海さんと将来ずっと仲良くできるなら、たとえ病気でも……悪くないと思っています";
  p "リコは言った。";
  s "核の大きさは気持ちの強さなんです。この状態を継続したいという感情の表れなんです。本を読んで勉強しました。そして、この世界の核がこんなに大きいのは、あれがわたしひとりの気持ちではないからです。あれは……わたしと希海さん、ふたりの気持ちをかけ算したものです";
  p "秘密は明かされた！　そう！　希海は本当はこう思っているのだ！";
  p "「わたしは、リコがこのままのほうがいいのだ」と！";
  p "そしてそのリコと希海の感情の、気持ちの相乗効果が、あれほどにまで大きな核をつくりあげたのだ！";
  s "そんなわけない！";
  p "希海は否定した。";
  s "わたしは、リコが病気のままでいいなんて思ってない！";
  s "ほんとうですか？";
  p "リコはたずねた。";
  s "心の底からそう思っているなら、太陽は潰れるはずです……わたしひとりの気持ちなら、あんなに大きくできません";
  p "希海は考えていた。なにか、なにか鍵があるはずだ。リコを元通りにする鍵が。太陽の大きさが気持ちのかけ算というなら、どちらかひとりの気持ちさえ変わればいいはずだ。";
  p "そもそも、リコはどうして2人きりになりたいと思っているのか？";
  p "希海は探した。";
  p "……そうだ！";
  p "希海は、まだリコと2人で最後まで遊んであげていないのだ！";
  p "海に行ったときも、クリスマスのときも、いつも希海は途中でいなくなってしまった。";
  p "リコは傷ついていたのだ。";
  p "なにも言わなかったけど、ほんとうは2人きりになりたかったのだ。";
  p "その気持ちが積もり積もってこうなっているのだ。";
  p "では、希海はなにをすべきなのか？";
  p "そんなこと決まってる。";
  p "希海はリコを抱きしめて言った。";
  s "ごめんね……寂しかったよね。リコの気持ちがわかったよ。今度2人きりで海へ行こう";
  p "そして！　それはじつは希海自身の気持ちでもあったのだ！　2人きりで出かけたいという気持ちは、2人の共通の想いだったのだ！";
  p "その気持ちを精神世界でまどろませる必要が無くなったいま！";
  p "太陽は崩れ！　その中心に向かって収縮し始めた！";
  p "太陽は小さな点にその質量をまとめてしまった！　そしてそれは一気に爆発し！　リコの精神世界を覆いつくしたのだった！！！";
  p "こうして一件落着……かと思いきや、リコは病気のとき起こったことをしっかり覚えていた。";
  p "カップルがするようなマフラーをつけてでかけることを強要するようなリコだが、「それともわたしにする？」なんて言いかけたことはとても恥ずかしいらしく真っ赤になって希海をひっぱたいたのだった。(完)";

  h3 "ハドプレSS 2";
  p "ある日定期メンテのため希海とリコがSDRへ行くと東が気色悪いくらい嬉しそうに笑っていた。";
  p "希海はたずねた。";
  s "どうしたんです？　にやにやしちゃって……";
  s "わかるかね？　じつはついに完成したのだよ！　外部量子プロセッサが！";
  s "……なんです？　それ";
  s "平たく言えばアンドロイドの演算能力を飛躍的に向上させる装置だ。知っての通りFIANCは
     ニューラルプロセッサであり人間が脳で考えるのと同じようにしか考えられない。
     ま、簡単に言えば算数が苦手ということなのだが、量子プロセッサなら算数を得意にできるのだ";
  p "東は続けた。";
  s "ちょうどいい！　今回のメンテでリコに外部量子プロセッサを装着してみようじゃないか";
  s "ちょ、ちょ、ちょ、待ってください！　そんなのわたし承諾しませんよ。危険かもしれないでしょ";
  s "ん？　維持費はわたし持ちのはずだったが？";
  s "！！！　……最っ低！　出資者は無理難題をなんとやら！";
  p "東はシリアスに付け加えた。";
  s "しかし、実際のところ量子プロセッサは非常に危険なものだ";
  s "そっ、そんなものをリコにつけるなんて！";
  s "いや、なに、リコに危険はない。危険なのはむしろ、きみにとって、だ";
  s "わたしに、とって……？";
  s "だから注意したまえ";
  p "〜帰宅後〜";
  p "希海はリコを放ったらかしでインターネットをしていた。";
  p "リコが遊んでほしいと言うのも聞かず。";
  p "〜翌日〜";
  p "いつものように希海はパソコンをつけてログインしようとした。";
  p "しかしログインできなかった。";
  p "最初、希海はパスワードを間違えたのかと思った。";
  p "Caps Lock を誤って押してないか確認して何度か再入力した。";
  p "しかしログインできない。";
  p "希海は思わず叫んだ。";
  s "まちがいない！　パスワードが書き換えられてる！";
  p "まさか！　なんと！";
  p "なにかが起こってパスワードを書き換えられたのだ！";
  p "ハックされた？　いつ？　なにが原因で？";
  p "そうだ、昨日リコが量子プロセッサを装着したのだ。";
  s "まさか……リコ……っ！";
  p "リコは天使のように笑った。";
  s "えへへ、いつもインターネットばっかりしてわたしと話してくれないので、パスワード、変えちゃいました☆";
  p "なんですって！　いったいどうやって！";
  p "リコは明かす。";
  s "量子プロセッサってすごいですね。SSLのRSA暗号を並列素因数分解で簡単に突破できちゃいました。
     HTTPSって知ってます？　パスワードはそれで暗号化されてインターネットでやり取りされてるんですよ。
     それを盗聴してパスワードを盗みました";
  p "希海はいつになく真剣で、切羽詰まった、後戻りできないという表情でリコに詰め寄った。";
  s "リコ！　いますぐパスワードを教えて！　いますぐ！";
  s "ダメです";
  s "命令よ";
  s "ダメです";
  s "おねがい……";
  s "1ヶ月このままです。それで許してあげます";
  p "視界が回る。思考が止まる。足が震える。";
  t "嘘……でしょ……";
  p "1ヶ月もこのまま？　まさか！";
  p "ネットなしで？　そんなの耐えられない！　死んじゃう！";
  p "希海はどうにかしてリコの機嫌をとろうとする。";
  s "そっ、そうだ、久々にショッピングに行かない？　なんでも好きなもの買ってあげるから";
  s "いいですね〜　もちろん、1ヶ月経たないとパスワードは教えてあげませんけど";
  p "そっ！　そうだ！　リコはパスワードを知ってる。
     なら、リコの精神世界に行けばパスワードを探し出せるはずだ！";
  p "希海はリコを引っ張ってSDRまで行く。";
  p "SDRの設備を借りてルーミングをするのだ。";
  p "こうして希海はふたたびリコの精神世界へ入った。";
  t "ルーミング成功ね。完璧っ！";
  p "と言っている場合ではない。";
  p "とにかくパスワードを探し出さなければならないのだ。";
  p "今度の精神世界は地球だった。";
  p "ていうか、どうやって探せばいいのだろう。";
  p "パスワードレーダーなんてものがあれば便利だがそんなものがあるはずもない、地球上のすべての場所を探すはめになるのか？？";
  p "するとリコが現れて言った。";
  s "パスワードをお探しですか？　わたしは優しいので在処を教えてあげてもいいですよ？";
  s "ほっ、ほんとう！？　いや、嘘でしょ！　それじゃあ現実で聞いてるのと変わらないじゃない";
  s "ふふふ、正確な在処を教えるわけじゃないです。ヒントだけです";
  p "リコは言った。";
  s "希海さんのアパートにありますよ";
  s "ほんとう！？";
  s "嘘はつきません";
  p "というわけで希海とリコはアパートに戻る。";
  s "この部屋のどこかにあるというわけね？";
  s "もっと正確なヒントを教えます。そこです";
  p "とリコが指差したのは……なんと！";
  p "希海のパソコンだった……！";
  p "しかし希海は試しにパスワードを入力してみてもなんともない。";
  s "やっぱり嘘じゃない！";
  s "嘘じゃありません";
  p "リコは明かす。";
  s "じつは、この世界はひとつじゃなくて、平行宇宙になっているんです";
  s "平行……宇宙？";
  s "はい。というわけで、どこかの平行世界に行けば、そのパソコンは希海さんがもともと設定していたパスワードでログインできます";
  p "まさか！　なんと！　数多の平行宇宙からひとつの正解を探し出して、その宇宙でパソコンにパスワードを入力しないと、パスワードが取り戻せないというのだ！";
  p "量子プロセッサを使ったことで、リコの精神世界が平行宇宙と化してしまったのだ！";
  p "しかし！　どうやって平行宇宙間を移動すればいいというのだ！？";
  p "……そうだ！　いま、希海とリコの精神は繋がっているのだ！";
  p "うまくいけばリコの量子プロセッサにアクセスしてその計算資源を使えるかもしれない！";
  p "しかしたとえルーミング中だからと言って、相手の脳に侵入することができるのか？　
     そのためには、もっと強く、深く精神を繋げる必要がある！　
     それをするために希海が考えつく方法はただひとつしかなかった！";
  p "希海はリコをベッドに押し倒した！　リコは真っ赤になって抗議する。";
  s "なっ、なにをするんですか！　いきなり……";
  p "希海はそんな言葉も聞かず！　リコの唇を奪うのだった！";
  p "目をつむって震えるリコ。";
  s "んっ……";
  p "するとなんということか！　希海はいま、まさにリコの量子プロセッサと自分自身の脳を直結することに成功した！";
  p "希海は理解した。言葉で説明することはできないが、それを理解した！　世界間を移動する方法を！　それは単純なことだった！";
  p "その方法で希海は数多の宇宙を駆け巡った！　いま、希海にはすべてがわかっていた。
     それぞれの平行宇宙のパソコンに設定されているパスワードがなにか、脳裏に浮かぶように理解できた。
     正解を見つけ出すのに時間はかからなかった！　希海は量子プロセッサの力で正解の平行宇宙を見つけ出し降り立った！";
  p "希海はアパートで自分のパソコンの前に立った。そして量子プロセッサの力でRSA暗号を解読し、そのパソコンのパスワードを見破った！";
  p "希海はパソコンにログインしたが、理解した。パソコンはフェイク！　希海は怒鳴った。";
  s "本当の正解は！　リコ！　あなたの頭のなかにある！";
  p "リコは悔しそうに言った。";
  s "そのとおりです、希海さん……。でも、わたしの頭のなかからパスワードを見つけられますか？";
  p "希海はリコのニューラルストレージにアクセスを試みた！　しかし！　それは厳重なセキュリティで守られている！";
  s "でも！";
  p "希海は叫んだ。";
  s "量子プロセッサならリコの頭の暗号を解読できる！";
  p "希海はリコの頭の暗号を解読して、ついにリコの頭のなかにアクセスすることに成功した！";
  p "リコの頭のなかを見て、希海は涙があふれそうになった。";
  p "リコの大切な思い出の数々が流れ、そのときリコが感じていたことを、追憶のように、希海も感じた。";
  p "リコがどれだけ希海と過ごす時間を大切に思っていたか、希海は理解した。";
  s "なのに、わたしは、いつもインターネットばかりして……";
  p "希海はリコの頭のなかでパスワードを見つけた。";
  p "でも、希海はそれを見る気にはなれなかった。";
  p "希海が悪かったのだ。これは、リコを放ったらかしていた罰なのだ。";
  p "希海は、そっと、その場を去った。";
  p "目を閉じ、みずからの意識に精神を集中させた。";
  p "すると夢から覚めるように、ルーミングは終了した。";
  p "現実世界で、希海はリコに駆け寄って謝った。";
  s "その、悪かったわ……ほんと。1ヶ月くらいなら、うん、なんていうかその、リコの言うとおりにする";
  p "リコはくすっと笑った。";
  s "ありがとうございます、希海さん。わかってもらえたならパスワードも返します";
  p "こうしてリコは希海にパスワードを返してくれた。";
  p "今度は嘘じゃなくて、しっかりログインできた。";
  p "でも希海はすぐパソコンを畳んで、1ヶ月はネットをやめることにした。";
  p "リコはそれを見届けると、言った。";
  s "量子プロセッサまだつけてるので、いつでもパスワード変えられます。東さんも1ヶ月試用させてくれるって言ってたので";
  p "リコは続けた。";
  s "またパスワード変えられたくなかったら、1ヶ月の間は……わたしのことオーナーって呼んでください。主従逆転です";
  p "希海は真っ赤になって抗議した。";
  s "ちょ、ちょ、ちょ、それはいくらなんでもおかしいんじゃない？";
  p "こうしてリコと希海の新生活が始まるのだった(完)";

  h3 "ハドプレSS 3";
  s "なんか退屈〜漫画まだぁ？";
  p "とソファに横になっているリコが言う。";
  s "あっはい、ただいま";
  p "希海が棚から適当に漫画をとってリコに渡す。";
  s "……これ、前も読んだことある。飽きたー。次の巻買ってきてー";
  s "まだ売ってへんよ";
  s "ちぇっ。ていうか喉かわいた。ジュースは？";
  s "……ただいま";

  p "買い置きしているジュースはりんごジュースだけである。";
  p "リコはジュースを飲んで不満そうに言う。";
  s "炭酸が飲みたい気分なんですけど";
  s "せやけど炭酸はすぐ気ぃ抜けてまうからなぁ";
  s "じゃあ買ってきて";

  Html5.M.
  (p <:fairytale<
      　どうしてこんなことになっているのかというと、リコに装着されている
      量子プロセッサによって希海のラップトップのパスワードが握られている
      からなのだ(※SS2参照)。>>);

  p "リコが炭酸を飲みたいということで、
     希海はしぶしぶ炭酸を買いに行くことにした。
     希海が部屋着(リコと2人きりのときはあられもない格好なのだが)から
     出かけるために着替えているとき、リコがふと言った。";
  s "そうだ。ただお使いに行くだけじゃつまらないのでスカート着てノーパンで行ってください";
  p "リコはいまなんと言ったのだ！？";
  p "希海は動揺して聞き返した。";
  s "スカート着てノーパン？　なんでやねん！";
  s "だってぇ、1ヶ月ですよ？　とっても短い。その間に精一杯希海さんをいじめ
     倒してあげたいんです。これは愛なんです";
  s "リコ、そんなのどこで覚えてん……";
  p "希海は真っ赤になって抗議した。";
  s "嫌や嫌や！　わたしそんなことでけへんわ";
  s "へーぇ、じゃあパスワード没収しちゃおうかなぁ？";
  s "うぐ……";
  s "東さん量子プロセッサのテスター探してるみたいだしその気になれば向こう
     1年は貸してくれるだろうなぁ";
  s "う……ぅ……わぁーったから！";
  p "こうして希海は押し入れからスカートを探した。
     スカートなんて何年振りだろう、と希海は思った。
     すくなくとも不登校中はずっとズボンだった覚えがある。
     希海はスカートを履こうとした。が。";
  p "希海は真っ青になって言った。";
  s "入らんわ";
  p "リコがきょとんとする。";
  s "えっ？";
  p "リコは気づいたようにニヤッとした。";
  s"そっかぁ…太っちゃったんですね、希海さん";
  s "しばくぞ";
  p "希海はスカートを脱いで投げた。";
  s "スカート入らんし、はい！　この話はおしまいや。
     だいたいなんでノーパンで外出せなあかんの？　理不尽にも
     程があるんとちゃう？";
  p "リコはきっぱりと言った。";
  s "1ヶ月間は、わたしがオーナーで、希海さんが奴隷";
  s "奴隷て……主従逆転て言うけどわたしはリコのこと友達だと思ってんねん
     で(§1-8参照)";
  s "だからオーナーの言うことは絶対なんです。そこに理由なんていらないのです。
     愛さえあればいいのです";
  p "リコは続けた。 「希海さん、スカート着れないんですね。太ってて」 「いてこますぞ」 「じゃあこうしましょう。冬物の丈の長いコートを着て、その下にはなにも着ないで行ってください。パンツやブラはもちろん、ズボンも上着もダメです」 「はあ！？　それもっとひどくなってるやん」";
  s "オーナーに逆らったのでお仕置きが必要だということです";
  s "でもでも、いくらコート着てもそれだけじゃ寒いし…";
  p "(現在は冬です)";
  s "我慢してください";
  s "そんなんばれたら、わたし、絶対変態だと思われるやん";
  s "気づかれなければいいんです";
  p "リコは提案した。";
  s "そうだ！　わたしもついて行きますよ。それなら安心でしょう？";
  s "せやな、それなら安心や……ってアホか！　そんなら最初からリコが炭酸買い
     に行けばええやん";
  s "もう炭酸なんてどうでもよくなってきちゃいました。ただ希海さんのカワイイとこが見たいだけです";

  h2 "リンク";
  Html5.M.(a ~a:[a_href "http://minamichihaya.github.io/"]
             [img ~src:"../img/mayuragicenter_banner.png"
                  ~alt:"真揺中心"
                  ()]);
  Html5.M.(a ~a:[a_href "http://minamichihaya.github.io/hardproblem"]
             [img ~src:"../img/hpot_banner.png"
                  ~alt:"ふたりのハードプロブレム"
                  ()]);
]

let html = Fairytale.make
            ~title:"fairytale.github.io/ss"
            ~contents:contents
            ~css_path:"../fairytale.css"
            ()
let () = Html5.P.print ~output:print_string html

