(*******************************************************************************
  Copyright (c) 2014 Pasberth
  https://github.com/pasberth/fairytale
 ******************************************************************************)

open Fairytale

let contents = [
  h2 "ハドプレSS 1";

  p "ある日希海が大学から帰ってくる(けっきょく希海はなんだかんだ言って復学したのだ)と、リコが希海に抱きついてきた！";

  s "おかえりなさい、希海さぁん……♥";

  p "なんだか妙に甘い声だ。";

  p "希海は不吉なものを感じて彼女の肩を掴んで彼女を離した。";

  s "どっ、どうしたの？　なんだか変よ？";

  p "よく見るとリコの目はとろとろで頬は紅潮している。";

  p "リコは言った。";

  s "ご飯にします？　お風呂にします？";

  p "と、希海はこれを見てなにかおかしいぞと思い、慌てて遮った。";

  s "なになになになに、今日はだれの誕生日？";

  s "ちがいますよぉ、素直な気持ちなんです";

  p "これでも希海は特定精神医療従事者の免許持っている。二種だけど。そんな希海がまず最初に考えたのはリコのFIANCが未知のニューロワームに感染してしまったということだ。";

  p "でも単純にほんとうにリコのサプライズかもしれない。";

  p "希海はたずねた。";

  s "もしこれがわたしを良い気持ちにさせるための冗談なら正直に答えて？　リコは計画的にそう言っているの？";

  p "リコは頬を膨らませて抗議した。";

  s "計画？　そんなものありませんよ。ただずっと想いを打ち明けたかっただけのことです";

  p "まちがいない。病気だ。";

  p "いや、もちろん本当にただ単にリコがそういう気持ちを持っているのかもしれないけど？";

  p "それにしては唐突すぎる。";

  s "次の休みの日、って言ってもわたし毎日朝9時に大学行かなくちゃいけないからいつになるかわかんないけど、病院に行ってしっかり検査してもらいましょう";

  p "しかしリコはアンドロイドなので病院に行くわけにも行かずけっきょくSDRの施設を借りて検査したのだった。パターン青。まちがいない。ニューロワームだ。";

  p "ニューロワームで新妻状態になるなんて話は聞いたことないのだけど、まあそういうこともあるのだろう、ともかく病気な以上、治療しなければならない。";

  p "設備を整えルーミング開始！";

  t "ルーミング成功ね。完璧っ！";

  p "と、そううまくいくわけにも行かない。";

  p "なんとその空間は地球ではなかった。";

  p "なぜ地球ではないと断言できるのか？";

  p "真っ黒な空に青い星が浮かんでいたのだ！";

  p "そしてあたりは銀色の砂漠。";

  s "ここって……月じゃない";

  p "酸欠にはならないものの重力の低さでふわふわ浮く希海。そして振り向いて10mほどの距離にリコが浮いていた。";

  s "リコ！　よかった……";

  s "希海さぁん……♥　会いたかった……♥";

  p "しかし、なぜ精神世界が月なのか？　その理由はリコの口から明かされた！";

  s "わたし、ずっと2人きりになりたかったんですよ……希海さんと……たった2人きりで……ずっと";

  p "まさか！　なんと！　月の世界は2人きりになりたいという欲望のあらわれだったのだ！";

  p "しかし！　いま、希海がそんなことを気にしている場合ではない！　問題は核！　カーネルを破壊すればリコは元通りになるはずだ！";

  p "しかし、カーネルが見当たらない？　いったいどこに？";

  p "リコが明かす。";

  s "核はあそこです";

  p "そして彼女が指差したのは……";

  p "希海は絶望する。";

  s "まさか……太陽……っ！？";

  p "まさか！　なんと！　この世界のカーネルは太陽なのだ！";

  p "希海は叫ぶ。";

  s "そんな！　太陽なんていったいどうやって破壊すれば……！　わたしの力では不可能だ！　超新星爆発級のエネルギーがないと……！";

  p "精神空間から中途離脱する方法は簡単だ。目を閉じ、自らの身体に意識を集中させればよい。";

  p "太陽を破壊するなんてそんなこと、いくら精神世界だからってぜったい不可能だ！　ひとまず逃げる---それもひとつの手段だ。";

  p "希海は絶望感から逃避を考え始めていた。";

  p "だけど！　ここで逃げるわけにはいかない！";

  p "リコを元通りにしなくちゃいけない！　これは希海に課された試練！　それは希海に託された使命なのだ！";

  p "希海は逃げなかった！　踏みとどまって戦うことを選択したのだ！";

  p "希海はリコを対話で説得しようと試みた。";

  p "核を破壊するのではなく、リコの帰りたいという気持ちを呼び覚ますことで解決しようと考えたのだ。";

  s "リコ、あなたはいま病気なのよ。自分では気づいていないかもしれないけど。気持ちは偽りのものなの";

  p "リコは答えた。";

  s "知ってます。気づいています";

  s "なら、どうして……";

  s "\"このままでもいい\"、むしろ、\"このままのほうがいい\"と思っているからです。わたしは希海さんと将来ずっと仲良くできるなら、たとえ病気でも……悪くないと思っています";

  p "リコは言った。";

  s "核の大きさは気持ちの強さなんです。この状態を継続したいという感情の表れなんです。本を読んで勉強しました。そして、この世界の核がこんなに大きいのは、あれがわたしひとりの気持ちではないからです。あれは……わたしと希海さん、ふたりの気持ちをかけ算したものです";

  p "秘密は明かされた！　そう！　希海は本当はこう思っているのだ！";

  p "「わたしは、リコがこのままのほうがいいのだ」と！";

  p "そしてそのリコと希海の感情の、気持ちの相乗効果が、あれほどにまで大きな核をつくりあげたのだ！";

  s "そんなわけない！";
  p "希海は否定した。";
  s "わたしは、リコが病気のままでいいなんて思ってない！";

  s "ほんとうですか？";
  p "リコはたずねた。";
  s "心の底からそう思っているなら、太陽は潰れるはずです……わたしひとりの気持ちなら、あんなに大きくできません";

  p "希海は考えていた。なにか、なにか鍵があるはずだ。リコを元通りにする鍵が。太陽の大きさが気持ちのかけ算というなら、どちらかひとりの気持ちさえ変わればいいはずだ。";

  p "そもそも、リコはどうして2人きりになりたいと思っているのか？";

  p "希海は探した。";

  p "……そうだ！";

  p "希海は、まだリコと2人で最後まで遊んであげていないのだ！";

  p "海に行ったときも、クリスマスのときも、いつも希海は途中でいなくなってしまった。";

  p "リコは傷ついていたのだ。";

  p "なにも言わなかったけど、ほんとうは2人きりになりたかったのだ。";

  p "その気持ちが積もり積もってこうなっているのだ。";

  p "では、希海はなにをすべきなのか？";

  p "そんなこと決まってる。";

  p "希海はリコを抱きしめて言った。";

  s "ごめんね……寂しかったよね。リコの気持ちがわかったよ。今度2人きりで海へ行こう";

  p "そして！　それはじつは希海自身の気持ちでもあったのだ！　2人きりで出かけたいという気持ちは、2人の共通の想いだったのだ！";

  p "その気持ちを精神世界でまどろませる必要が無くなったいま！";

  p "太陽は崩れ！　その中心に向かって収縮し始めた！";

  p "太陽は小さな点にその質量をまとめてしまった！　そしてそれは一気に爆発し！　リコの精神世界を覆いつくしたのだった！！！";

  p "こうして一件落着……かと思いきや、リコは病気のとき起こったことをしっかり覚えていた。";

  p "カップルがするようなマフラーをつけてでかけることを強要するようなリコだが、「それともわたしにする？」なんて言いかけたことはとても恥ずかしいらしく真っ赤になって希海をひっぱたいたのだった。(完)";
]

let html = Fairytale.make
            ~title:"SS"
            ~contents:contents
            ~css_path:"../fairytale.css"
            ()
let () = Html5.P.print ~output:print_string html

